---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveShowNumber
source: html/10b44bda-21c5-26a1-db75-ba33bab866d5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveShowNumber Property

"Show Placement Number"

## Syntax (C#)
```csharp
public static ForgeTypeId PointAdaptiveShowNumber { get; }
```